# how to create dataframe

In [1]:
import pandas as pd

In [2]:
em=pd.DataFrame()

In [3]:
print(em)

Empty DataFrame
Columns: []
Index: []

In [4]:
l=['a','b','c']
print(l)

['a', 'b', 'c']

In [5]:
df1=pd.DataFrame(l)
print(df1)

   0
0  a
1  b
2  c

In [6]:
df1

   0
0  a
1  b
2  c

In [7]:
l2=[[1,2,3],[2,3,4],[6,8,9]]

In [8]:
l2

[[1, 2, 3], [2, 3, 4], [6, 8, 9]]

In [12]:
df2=pd.DataFrame(l2)

In [13]:
df2

   0  1  2
0  1  2  3
1  2  3  4
2  6  8  9

In [14]:
d={'ID':[1,2,4,5]}

In [15]:
df3=pd.DataFrame(d)

In [16]:
df3

   ID
0   1
1   2
2   4
3   5

In [18]:
d3={'ID':[1,2,4,5],'Sn':[1,7,9,0]}

In [19]:
d3

{'ID': [1, 2, 4, 5], 'Sn': [1, 7, 9, 0]}

In [20]:
df4=pd.DataFrame(d3)

In [21]:
df4

   ID  Sn
0   1   1
1   2   7
2   4   9
3   5   0

In [22]:
l4=[{'a':4,'b':5},{'a':7,'b':0}]

In [23]:
df5=pd.DataFrame(l4)

In [25]:
df5

   a  b
0  4  5
1  7  0

In [26]:
l4=[{'a':4,'b':5},{'a':7,'b':0,'c':8}]

In [27]:
df6=pd.DataFrame(l4)

In [28]:
df6

   a  b    c
0  4  5  NaN
1  7  0  8.0

In [29]:
d7={'a':pd.Series([1,2,3]),'Sn':pd.Series([24,57,88])}

In [30]:
df7=pd.DataFrame(d7)

In [31]:
df7

   a  Sn
0  1  24
1  2  57
2  3  88